An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # turbot_policy_setting.aws_alb_access_logging will be created
  + resource "turbot_policy_setting" "aws_alb_access_logging" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/applicationLoadBalancerAccessLogging"
      + value                        = "Check: Enabled"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_cloudtrail_trail_encryption_at_rest will be created
  + resource "turbot_policy_setting" "aws_cloudtrail_trail_encryption_at_rest" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-cloudtrail#/policy/types/trailEncryptionAtRest"
      + value                        = "Check: Customer managed key"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_cloudtrail_trail_log_validation will be created
  + resource "turbot_policy_setting" "aws_cloudtrail_trail_log_validation" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-cloudtrail#/policy/types/trailLogFileValidation"
      + value                        = "Check: Enabled"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_cloudtrail_trail_status will be created
  + resource "turbot_policy_setting" "aws_cloudtrail_trail_status" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-cloudtrail#/policy/types/trailStatus"
      + value                        = "Check: No delivery errors"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_elb_access_logging will be created
  + resource "turbot_policy_setting" "aws_elb_access_logging" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/classicLoadBalancerAccessLogging"
      + value                        = "Check: Enabled"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_nlb_access_logging will be created
  + resource "turbot_policy_setting" "aws_nlb_access_logging" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/networkLoadBalancerAccessLogging"
      + value                        = "Check: Enabled"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_smart_folder.aws_logging will be created
  + resource "turbot_smart_folder" "aws_logging" {
      + description = "Defines sets of policies for the AWS check logging baseline"
      + id          = (known after apply)
      + parent      = "tmod:@turbot/turbot#/"
      + parent_akas = (known after apply)
      + title       = "AWS Check Logging Policies"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + smart_folder_description     = "Defines sets of policies for the AWS check logging baseline"
  + smart_folder_name            = "AWS Check Logging Policies"
  + smart_folder_parent_resource = "tmod:@turbot/turbot#/"
  + turbot_profile               = "default"

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

turbot_smart_folder.aws_logging: Creating...
turbot_smart_folder.aws_logging: Creation complete after 1s [id=215530530696585]
turbot_policy_setting.aws_cloudtrail_trail_status: Creating...
turbot_policy_setting.aws_nlb_access_logging: Creating...
turbot_policy_setting.aws_cloudtrail_trail_log_validation: Creating...
turbot_policy_setting.aws_alb_access_logging: Creating...
turbot_policy_setting.aws_elb_access_logging: Creating...
turbot_policy_setting.aws_cloudtrail_trail_encryption_at_rest: Creating...
turbot_policy_setting.aws_cloudtrail_trail_log_validation: Creation complete after 2s [id=215530533167560]
turbot_policy_setting.aws_cloudtrail_trail_status: Creation complete after 2s [id=215530533166535]
turbot_policy_setting.aws_elb_access_logging: Creation complete after 2s [id=215530533655006]
turbot_policy_setting.aws_alb_access_logging: Creation complete after 2s [id=215530533545425]
turbot_policy_setting.aws_cloudtrail_trail_encryption_at_rest: Creation complete after 2s [id=215530533651931]
turbot_policy_setting.aws_nlb_access_logging: Creation complete after 2s [id=215530533655004]

Apply complete! Resources: 7 added, 0 changed, 0 destroyed.

Outputs:

smart_folder_description = "Defines sets of policies for the AWS check logging baseline"
smart_folder_name = "AWS Check Logging Policies"
smart_folder_parent_resource = "tmod:@turbot/turbot#/"
turbot_profile = "default"
